Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                         FILE                                          | NAMESPACE | MESSAGE |
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/data.tf      | main      | SUCCESS |
+---------+---------------------------------------------------------------------------------------+-----------+---------+

2024-08-30T01:36:14.572Z [INFO]  Terraform version: 1.4.6
2024-08-30T01:36:14.572Z [INFO]  Go runtime version: go1.19.6
2024-08-30T01:36:14.572Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-30T01:36:14.573Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-30T01:36:14.725Z [INFO]  Testing if Service Principal / Client Certificate is applicable for Authentication..
2024-08-30T01:36:14.725Z [INFO]  Testing if Multi Tenant Service Principal / Client Secret is applicable for Authentication..
2024-08-30T01:36:14.725Z [INFO]  Testing if Service Principal / Client Secret is applicable for Authentication..
2024-08-30T01:36:14.726Z [INFO]  Using Service Principal / Client Secret for Authentication
2024-08-30T01:36:14.726Z [INFO]  Getting OAuth config for endpoint https://login.microsoftonline.com/ with  tenant 4cf7eae5-1a2c-460b-b602-1c4654455f6e
2024-08-30T01:36:23.942Z [INFO]  backend/local: starting Plan operation
2024-08-30T01:36:25.092Z [INFO]  provider: configuring client automatic mTLS
2024-08-30T01:36:25.471Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-30T01:36:25.471Z
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.273Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.274Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.274Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.274Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.274Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-30T01:36:32.274Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:32.381Z [INFO]  provider: configuring client automatic mTLS
2024-08-30T01:36:32.668Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-30T01:36:32.668Z
2024-08-30T01:36:40.472Z [INFO]  backend/local: plan calling Plan
2024-08-30T01:36:40.475Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.475Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.475Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.475Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.568Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.569Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.570Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:40.868Z [INFO]  provider: configuring client automatic mTLS
2024-08-30T01:36:41.171Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-30T01:36:41.171Z
2024-08-30T01:36:48.870Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.772Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:57.773Z [INFO]  ReferenceTransformer: reference not found: "each.value"
data.azurerm_subnet.default: Reading...
data.azurerm_private_dns_zone.default: Reading...
data.azurerm_subnet.delegated: Reading...
2024-08-30T01:36:57.973Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .auto_grow_enabled: planned value cty.False for a non-computed attribute
      - .geo_redundant_backup_enabled: planned value cty.False for a non-computed attribute
      - .authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "local.database"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.068Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.069Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-30T01:36:58.069Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-30T01:36:58.069Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.069Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-30T01:36:58.069Z [INFO]  ReferenceTransformer: reference not found: "each.key"
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-app]
data.azurerm_private_dns_zone.default: Read complete after 0s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
data.azurerm_subnet.delegated: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-pg-delegated]
2024-08-30T01:36:58.769Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-30T01:36:58.868Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.868Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-30T01:36:58.868Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.869Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.870Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.871Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.871Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.871Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-30T01:36:58.871Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-30T01:36:58.871Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-30T01:36:58.873Z [INFO]  backend/local: plan operation completed
2024-08-30T01:36:58.873Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server" "default" {
+       administrator_login           = "psqladmin"
+       administrator_password        = (sensitive value)
+       auto_grow_enabled             = false
+       backup_retention_days         = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "eastus2"
+       name                          = "backstage-demo"
+       private_dns_zone_id           = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "my-rg"
+       sku_name                      = "GP_Standard_D2s_v3"
+       storage_mb                    = 32768
+       storage_tier                  = "P30"
+       tags                          = {
+           "terraform" = "true"
        }
+       version                       = "14"
+       zone                          = "1"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
+       id        = (known after apply)
+       name      = "azure.extensions"
+       server_id = (known after apply)
+       value     = "CUBE,CITEXT,BTREE_GIST"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.default["backstage"] will be created
+ resource "azurerm_postgresql_flexible_server_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.utf8"
+       id        = (known after apply)
+       name      = "backstage"
+       server_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pgsq_fqdn                          = (known after apply)
+ pgsq_id                            = (known after apply)

Generating Infracost cost estimates for terraform/staging...

ls: /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json: No such file or directory
cat: can't open '/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json': No such file or directory
2024-08-30T01:37:01Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-30T01:37:01Z DEBUG 'POST' request to '/graphql' using trace_id: '7ce7c56c-500b-42fa-99e9-3d8809a34a15'
2024-08-30T01:37:01Z DEBUG performing request method POST url https://dashboard.api.infracost.io/graphql library=retryablehttp
2024-08-30T01:37:01Z DEBUG Successfully loaded settings from Infracost Cloud result="{CloudEnabled:false ActualCostsEnabled:false UsageAPIEnabled:false TagsAPIEnabled:false PoliciesAPIEnabled:false}"
2024-08-30T01:37:01Z DEBUG 'POST' request to '/graphql' using trace_id: '7ce7c56c-500b-42fa-99e9-3d8809a34a15'
2024-08-30T01:37:01Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2024-08-30T01:37:01Z DEBUG os env 'ATLANTIS_WRITE_GIT_CREDS=true' matched prefix 'ATLANTIS_'
2024-08-30T01:37:01Z DEBUG fetching Atlantis VCS metadata
2024-08-30T01:37:01Z DEBUG could not get local git file changes, failed to get the previous commit to compare the current commit against, this is likely because of a shallow clone in CI error=EOF
2024-08-30T01:37:01Z ERROR Could not autodetect any projects from path "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json"
2024-08-30T01:37:01Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-30T01:37:02Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-30T01:37:02Z DEBUG Skipping sending project results since Infracost Cloud upload is not enabled.
2024-08-30T01:37:02Z DEBUG 'POST' request to '/event' using trace_id: '7ce7c56c-500b-42fa-99e9-3d8809a34a15'
2024-08-30T01:37:02Z DEBUG performing request method POST url https://pricing.api.infracost.io/event library=retryablehttp
2024-08-30T01:37:02Z INFO Output saved to /tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
2024-08-30T01:37:02Z DEBUG writing 0 objects to filesystem cache
2024-08-30T01:37:02Z DEBUG could not flush pricing API cache to filesystem error="open /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json/.infracost/pricing.gob: no such file or directory"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://20.231.233.233/lock?id=leandromoreirati%252Fbackstage-demo%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```